{
  "2026": {
    "HK": [
      {
        "date": "2026-01-01",
        "name": "元旦"
      },
      {
        "date": "2026-02-17",
        "name": "農曆年初一"
      },
      {
        "date": "2026-02-18",
        "name": "農曆年初二"
      },
      {
        "date": "2026-02-19",
        "name": "農曆年初三"
      },
      {
        "date": "2026-04-03",
        "name": "耶穌受難節"
      },
      {
        "date": "2026-04-04",
        "name": "耶穌受難節翌日"
      },
      {
        "date": "2026-04-06",
        "name": "復活節星期一"
      },
      {
        "date": "2026-04-07",
        "name": "清明節翌日"
      },
      {
        "date": "2026-05-01",
        "name": "勞動節"
      },
      {
        "date": "2026-05-25",
        "name": "佛誕翌日"
      },
      {
        "date": "2026-06-19",
        "name": "端午節"
      },
      {
        "date": "2026-07-01",
        "name": "香港特別行政區成立紀念日"
      },
      {
        "date": "2026-09-26",
        "name": "中秋節翌日"
      },
      {
        "date": "2026-10-01",
        "name": "國慶日"
      },
      {
        "date": "2026-10-19",
        "name": "重陽節翌日"
      },
      {
        "date": "2026-12-25",
        "name": "聖誕節"
      },
      {
        "date": "2026-12-26",
        "name": "聖誕節後第一個周日"
      }
    ],
    "US": [
      {
        "date": "2026-01-01",
        "name": "New Year's Day"
      },
      {
        "date": "2026-01-19",
        "name": "Martin Luther King Jr. Day"
      },
      {
        "date": "2026-02-16",
        "name": "Washington's Birthday"
      },
      {
        "date": "2026-05-25",
        "name": "Memorial Day"
      },
      {
        "date": "2026-06-19",
        "name": "Juneteenth National Independence Day"
      },
      {
        "date": "2026-07-03",
        "name": "Independence Day (observed)"
      },
      {
        "date": "2026-09-07",
        "name": "Labor Day"
      },
      {
        "date": "2026-10-12",
        "name": "Columbus Day"
      },
      {
        "date": "2026-11-11",
        "name": "Veterans Day"
      },
      {
        "date": "2026-11-26",
        "name": "Thanksgiving Day"
      },
      {
        "date": "2026-12-25",
        "name": "Christmas Day"
      }
    ],
    "JP": [
      {
        "date": "2026-01-01",
        "name": "元日"
      },
      {
        "date": "2026-01-12",
        "name": "成人の日"
      },
      {
        "date": "2026-02-11",
        "name": "建国記念の日"
      },
      {
        "date": "2026-02-23",
        "name": "天皇誕生日"
      },
      {
        "date": "2026-03-20",
        "name": "春分の日"
      },
      {
        "date": "2026-04-29",
        "name": "昭和の日"
      },
      {
        "date": "2026-05-03",
        "name": "憲法記念日"
      },
      {
        "date": "2026-05-04",
        "name": "みどりの日"
      },
      {
        "date": "2026-05-05",
        "name": "こどもの日"
      },
      {
        "date": "2026-05-06",
        "name": "振替休日"
      },
      {
        "date": "2026-07-20",
        "name": "海の日"
      },
      {
        "date": "2026-08-11",
        "name": "山の日"
      },
      {
        "date": "2026-09-21",
        "name": "敬老の日"
      },
      {
        "date": "2026-09-22",
        "name": "国民の休日"
      },
      {
        "date": "2026-09-23",
        "name": "秋分の日"
      },
      {
        "date": "2026-10-12",
        "name": "スポーツの日"
      },
      {
        "date": "2026-11-03",
        "name": "文化の日"
      },
      {
        "date": "2026-11-23",
        "name": "勤労感謝の日"
      }
    ],
    "TW": [
      {
        "date": "2026-01-01",
        "name": "元旦"
      },
      {
        "date": "2026-02-16",
        "name": "除夕"
      },
      {
        "date": "2026-02-17",
        "name": "春節"
      },
      {
        "date": "2026-02-18",
        "name": "春節假期"
      },
      {
        "date": "2026-02-19",
        "name": "春節假期"
      },
      {
        "date": "2026-02-20",
        "name": "春節假期"
      },
      {
        "date": "2026-02-27",
        "name": "和平紀念日補假"
      },
      {
        "date": "2026-02-28",
        "name": "和平紀念日"
      },
      {
        "date": "2026-04-03",
        "name": "兒童節補假"
      },
      {
        "date": "2026-04-04",
        "name": "兒童節"
      },
      {
        "date": "2026-04-05",
        "name": "清明節"
      },
      {
        "date": "2026-04-06",
        "name": "清明節補假"
      },
      {
        "date": "2026-05-01",
        "name": "勞動節"
      },
      {
        "date": "2026-06-19",
        "name": "端午節"
      },
      {
        "date": "2026-09-25",
        "name": "中秋節"
      },
      {
        "date": "2026-10-09",
        "name": "國慶日補假"
      },
      {
        "date": "2026-10-10",
        "name": "國慶日"
      }
    ],
    "CN": [
      {
        "date": "2026-01-01",
        "name": "元旦"
      },
      {
        "date": "2026-02-16",
        "name": "除夕／春節假期"
      },
      {
        "date": "2026-02-17",
        "name": "春節"
      },
      {
        "date": "2026-02-18",
        "name": "春節假期"
      },
      {
        "date": "2026-02-19",
        "name": "春節假期"
      },
      {
        "date": "2026-02-20",
        "name": "春節假期"
      },
      {
        "date": "2026-04-04",
        "name": "清明節假期"
      },
      {
        "date": "2026-04-05",
        "name": "清明節"
      },
      {
        "date": "2026-04-06",
        "name": "清明節假期"
      },
      {
        "date": "2026-05-01",
        "name": "勞動節"
      },
      {
        "date": "2026-05-02",
        "name": "勞動節假期"
      },
      {
        "date": "2026-05-03",
        "name": "勞動節假期"
      },
      {
        "date": "2026-06-19",
        "name": "端午節"
      },
      {
        "date": "2026-09-25",
        "name": "中秋節"
      },
      {
        "date": "2026-10-01",
        "name": "國慶節"
      },
      {
        "date": "2026-10-02",
        "name": "國慶節假期"
      },
      {
        "date": "2026-10-03",
        "name": "國慶節假期"
      },
      {
        "date": "2026-10-04",
        "name": "國慶節假期"
      },
      {
        "date": "2026-10-05",
        "name": "國慶節假期"
      },
      {
        "date": "2026-10-06",
        "name": "國慶節假期"
      },
      {
        "date": "2026-10-07",
        "name": "國慶節假期"
      }
    ]
  },
  "2027": {
    "HK": [
      {
        "date": "2027-01-01",
        "name": "元旦"
      },
      {
        "date": "2027-02-06",
        "name": "農曆年初一"
      },
      {
        "date": "2027-02-07",
        "name": "農曆年初二（星期日）"
      },
      {
        "date": "2027-02-08",
        "name": "農曆年初三"
      },
      {
        "date": "2027-02-09",
        "name": "農曆年初四補假"
      },
      {
        "date": "2027-03-26",
        "name": "耶穌受難節"
      },
      {
        "date": "2027-03-27",
        "name": "耶穌受難節翌日"
      },
      {
        "date": "2027-03-29",
        "name": "復活節星期一"
      },
      {
        "date": "2027-04-05",
        "name": "清明節"
      },
      {
        "date": "2027-05-01",
        "name": "勞動節"
      },
      {
        "date": "2027-05-13",
        "name": "佛誕"
      },
      {
        "date": "2027-06-09",
        "name": "端午節"
      },
      {
        "date": "2027-07-01",
        "name": "香港特別行政區成立紀念日"
      },
      {
        "date": "2027-09-16",
        "name": "中秋節翌日"
      },
      {
        "date": "2027-10-01",
        "name": "國慶日"
      },
      {
        "date": "2027-10-08",
        "name": "重陽節"
      },
      {
        "date": "2027-12-25",
        "name": "聖誕節"
      },
      {
        "date": "2027-12-27",
        "name": "聖誕節後第一個周日補假"
      }
    ],
    "US": [
      {
        "date": "2027-01-01",
        "name": "New Year's Day"
      },
      {
        "date": "2027-01-18",
        "name": "Birthday of Martin Luther King Jr."
      },
      {
        "date": "2027-02-15",
        "name": "Washington's Birthday"
      },
      {
        "date": "2027-05-31",
        "name": "Memorial Day"
      },
      {
        "date": "2027-06-18",
        "name": "Juneteenth National Independence Day (observed)"
      },
      {
        "date": "2027-07-05",
        "name": "Independence Day (observed)"
      },
      {
        "date": "2027-09-06",
        "name": "Labor Day"
      },
      {
        "date": "2027-10-11",
        "name": "Columbus Day"
      },
      {
        "date": "2027-11-11",
        "name": "Veterans Day"
      },
      {
        "date": "2027-11-25",
        "name": "Thanksgiving Day"
      },
      {
        "date": "2027-12-24",
        "name": "Christmas Day (observed)"
      }
    ],
    "JP": [
      {
        "date": "2027-01-01",
        "name": "元日"
      },
      {
        "date": "2027-01-11",
        "name": "成人の日"
      },
      {
        "date": "2027-02-11",
        "name": "建国記念の日"
      },
      {
        "date": "2027-02-23",
        "name": "天皇誕生日"
      },
      {
        "date": "2027-03-21",
        "name": "春分の日"
      },
      {
        "date": "2027-03-22",
        "name": "振替休日"
      },
      {
        "date": "2027-04-29",
        "name": "昭和の日"
      },
      {
        "date": "2027-05-03",
        "name": "憲法記念日"
      },
      {
        "date": "2027-05-04",
        "name": "みどりの日"
      },
      {
        "date": "2027-05-05",
        "name": "こどもの日"
      },
      {
        "date": "2027-07-19",
        "name": "海の日"
      },
      {
        "date": "2027-08-11",
        "name": "山の日"
      },
      {
        "date": "2027-09-20",
        "name": "敬老の日"
      },
      {
        "date": "2027-09-23",
        "name": "秋分の日"
      },
      {
        "date": "2027-10-11",
        "name": "スポーツの日"
      },
      {
        "date": "2027-11-03",
        "name": "文化の日"
      },
      {
        "date": "2027-11-23",
        "name": "勤労感謝の日"
      }
    ],
    "TW": [
      {
        "date": "2027-01-01",
        "name": "中華民國開國紀念日"
      },
      {
        "date": "2027-02-04",
        "name": "春節連假"
      },
      {
        "date": "2027-02-05",
        "name": "除夕"
      },
      {
        "date": "2027-02-06",
        "name": "春節"
      },
      {
        "date": "2027-02-07",
        "name": "春節假期"
      },
      {
        "date": "2027-02-08",
        "name": "春節假期"
      },
      {
        "date": "2027-02-09",
        "name": "春節假期"
      },
      {
        "date": "2027-02-10",
        "name": "春節假期"
      },
      {
        "date": "2027-02-28",
        "name": "和平紀念日"
      },
      {
        "date": "2027-03-01",
        "name": "和平紀念日補假"
      },
      {
        "date": "2027-04-04",
        "name": "兒童節"
      },
      {
        "date": "2027-04-05",
        "name": "清明節"
      },
      {
        "date": "2027-04-06",
        "name": "兒童節及清明節補假"
      },
      {
        "date": "2027-04-30",
        "name": "勞動節補假"
      },
      {
        "date": "2027-05-01",
        "name": "勞動節"
      },
      {
        "date": "2027-10-10",
        "name": "國慶日"
      },
      {
        "date": "2027-10-11",
        "name": "國慶日補假"
      },
      {
        "date": "2027-10-24",
        "name": "臺灣光復暨金門古寧頭大捷紀念日"
      },
      {
        "date": "2027-10-25",
        "name": "臺灣光復暨金門古寧頭大捷紀念日補假"
      },
      {
        "date": "2027-12-25",
        "name": "行憲紀念日"
      },
      {
        "date": "2027-12-27",
        "name": "行憲紀念日補假"
      }
    ],
    "CN": [
      {
        "date": "2027-01-01",
        "name": "元旦（暫定）"
      },
      {
        "date": "2027-02-05",
        "name": "除夕／春節（暫定）"
      },
      {
        "date": "2027-02-06",
        "name": "春節（暫定）"
      },
      {
        "date": "2027-02-07",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-02-08",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-02-09",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-02-10",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-02-11",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-02-12",
        "name": "春節假期（暫定）"
      },
      {
        "date": "2027-04-03",
        "name": "清明節假期（暫定）"
      },
      {
        "date": "2027-04-04",
        "name": "清明節假期（暫定）"
      },
      {
        "date": "2027-04-05",
        "name": "清明節（暫定）"
      },
      {
        "date": "2027-05-01",
        "name": "勞動節（暫定）"
      },
      {
        "date": "2027-05-02",
        "name": "勞動節假期（暫定）"
      },
      {
        "date": "2027-05-03",
        "name": "勞動節假期（暫定）"
      },
      {
        "date": "2027-06-09",
        "name": "端午節（暫定）"
      },
      {
        "date": "2027-09-15",
        "name": "中秋節（暫定）"
      },
      {
        "date": "2027-10-01",
        "name": "國慶節（暫定）"
      },
      {
        "date": "2027-10-02",
        "name": "國慶節假期（暫定）"
      },
      {
        "date": "2027-10-03",
        "name": "國慶節假期（暫定）"
      },
      {
        "date": "2027-10-04",
        "name": "國慶節假期（暫定）"
      },
      {
        "date": "2027-10-05",
        "name": "國慶節假期（暫定）"
      },
      {
        "date": "2027-10-06",
        "name": "國慶節假期（暫定）"
      },
      {
        "date": "2027-10-07",
        "name": "國慶節假期（暫定）"
      }
    ]
  }
}
